[
    {
       "id":1,
       "questionName":"Difference between javascript and nodejs",
       "Answer":
            {
              "def": "javascript is a smiple programming language taht runs in any broweser javasscript enginte. where node JS is an interpreter or running environment for a javascript programming language that hold many excesses, it requires libraries that can easily be accessed from javascript programming for better use. ",
              "difference1":[
                 "Javascript is a programming language that is used for writing scripts on the website.",
                 "Javascript can only be run in the browsers.",
                 "It is basically used on the client-side",
                 "Javascript is capable enough to add HTML and play with the DOM",
                 "Javascript is used in frontend development.",
                 "Some of the javascript frameworks are RamdaJS, TypedJS, etc. "
              ], 
              "difference2":[
                 "NodeJS is a Javascript runtime environment.",
                 "We can run Javascript outside the browser with the help of NodeJS.",
                 "We can run Javascript outside the browser with the help of NodeJS.",
                 "It is mostly used on the server-side.",
                 "Nodejs does not have capability to add HTML tags",
                 "Nodejs is used in server-side development",
                 "Some of the Nodejs modules are Lodash, express etc. These modules are to be imported from npm. "
              ]
            }
       
       
    },
    {
       "id":2,
       "questionName":" When should you use nodejs and when should you use mongodb?",
       "Answer":{
          "def":"Node.js is an open-source JavaScript runtime environment that allows back-end developers to use JavaScript to create server-side applications and APIs. MongoDB is an open-source, non-relational database developed by MongoDB, Inc. MongoDB stores data as documents in a binary representation called BSON (Binary JSON). Related information is stored together for fast query access through the MongoDB query language.",
          "difference1":[
             "MongoDB: The NoSQL Non-Relational Database",
             "Dynamic schema: As mentioned, this gives you flexibility to change your data schema without modifying any of your existing data.",
             "Scalability: MongoDB is horizontally scalable, which helps reduce the workload and scale your business with ease.",
             "Manageability: The database doesn’t require a database administrator. Since it is fairly user-friendly in this way, it can be used by both developers and administrators.",
             "Speed: It’s high-performing for simple queries. • Flexibility: You can add new columns or fields on MongoDB without affecting existing rows or application performance."
          ],
          "difference2":[
             "I/O calls do not block the main thread; ",
             "Server keeps processing user requests simultaneously;",
             "Simple and popular JavaScript language",
             "Suits both front-end and back-end ",
             "Rich ecosystem",
             "Data streaming means breaking large files into smaller batches to provide smooth and impeccable streaming"
          ]
          
       }
       
    },
    {
       "id":3,
       "questionName":" Differences between sql and nosql databases?",
       "Answer":{
         "def":"SQL databases defines and manipulates data based structured query language (SQL). SQL is one of the most versatile and widely-used options available which makes it a safe choice especially for great complex queries. A NoSQL database has dynamic schema for unstructured data. Data is stored in many ways which means it can be document-oriented, column-oriented, graph-based or organized as a KeyValue store",
         "difference1":[
               "RELATIONAL DATABASE MANAGEMENT SYSTEM (RDBMS)",
               "These databases have fixed or static or predefined schema",
               "These databases are not suited for hierarchical data storage.",
               "These databases are best suited for complex queries",
               "Vertically Scalable",
               "Follows ACID property"

         ],
         "difference2":[
            "Non-relational or distributed database system.",
            "They have dynamic schema",
            "These databases are best suited for hierarchical data storage.",
            "These databases are not so good for complex queries",
            "Horizontally scalable",
            "Follows CAP(consistency, availability, partition tolerance)"
         ]
         
      }
       
    },
    {
       "id":4,
       "questionName":"What is the purpose of jwt and how does it work?",
       "Answer":{
         "def":"JWT, or JSON Web Token, is an open standard used to share security information between two parties — a client and a server. Each JWT contains encoded JSON objects, including a set of claims. JWTs are signed using a cryptographic algorithm to ensure that the claims cannot be altered after the token is issued.",
         "difference1":[
               "JWT is a string made up of three parts, separated by dots (.), and serialized using base64. In the most common serialization format, compact serialization, the JWT looks something like this: xxxxx.yyyyy.zzzzz.",
               "1.The header ",
               "2. The payload",
               "3. The signature.",
               "The header typically consists of two parts: the type of the token, which is JWT, and the signing algorithm being used, such as HMAC SHA256 or RSA.",
               "The second part of the token is the payload, which contains the claims. Claims are statements about an entity (typically, the user) and additional data. There are three types of claims: registered, public, and private claims.",
               "To create the signature part you have to take the encoded header, the encoded payload, a secret, the algorithm specified in the header, and sign that."

         ],
         "difference2":[  ]
         
      }
       
    }

]